In [26]:
# Importing the required library
import pandas as pd
import numpy as np
 
# Creating a DataFrame 'new_employees'
new_employees = pd.DataFrame({'name': ['George', 'Jill', 'Thomas', 'Jim', 'Shelby'], 'age': [25, 24, 24, 27, 26],  'gender': ['M', 'F', 'M', 'F', 'F'], 'start_date': ['02-01-2022', '02-01-2022', '02-02-2022', '02-03-2022', '02-04-2022'],'salary': [50000, 48000, 45000, 60000, 55000]},index=[1, 2, 3, 4, 5])
 
# Printing the DataFrame
new_employees

     name  age gender  start_date  salary
1  George   25      M  02-01-2022   50000
2    Jill   24      F  02-01-2022   48000
3  Thomas   24      M  02-02-2022   45000
4     Jim   27      F  02-03-2022   60000
5  Shelby   26      F  02-04-2022   55000

In [27]:
new_employees.loc[(new_employees == '02-01-2022').any(axis=1), 'name'].count()

2

In [28]:
new_employees.loc[new_employees['salary'] < 50_000, ['name', 'salary']]

     name  salary
2    Jill   48000
3  Thomas   45000

In [31]:
new_employees["team"] = ["HR", "Sales", "Administration", "Sales", "Technology"]
new_employees

     name  age gender  start_date  salary            team
1  George   25      M  02-01-2022   50000              HR
2    Jill   24      F  02-01-2022   48000           Sales
3  Thomas   24      M  02-02-2022   45000  Administration
4     Jim   27      F  02-03-2022   60000           Sales
5  Shelby   26      F  02-04-2022   55000      Technology

In [30]:
pd.Series(np.array(['HR', 'Sales', 'Administration', 'Sales', 'Technology']))

0                HR
1             Sales
2    Administration
3             Sales
4        Technology
dtype: object

In [36]:
df_admin = new_employees.drop(["age", "salary"], axis=1)
df_admin

     name gender  start_date            team
1  George      M  02-01-2022              HR
2    Jill      F  02-01-2022           Sales
3  Thomas      M  02-02-2022  Administration
4     Jim      F  02-03-2022           Sales
5  Shelby      F  02-04-2022      Technology